tests/fixtures/invoices-get-many.json

{
    "items": [
        {
            "id": 1,
            "number": "#TT1100720",
            "customerId": 1,
            "customerName": "Test OÜ",
            "date": "2020-07-10",
            "currencyCode": "CURRENCY_EUR",
            "discountPercent": 0.000000,
            "languageCode": "LANGUAGE_EN",
            "vatPercent": 0.0000,
            "referenceNumber": "",
            "deadlineDate": "2020-07-17",
            "creatorName": null,
            "modifierName": null,
            "sumNoVat": 3.670000,
            "taxSum": null,
            "sumWithVat": 4.400000,
            "sumPaid": 4.400000,
            "sumLeftToPay": null,
            "invoiceTextsInfoId": 272768,
            "penaltyPercent": 0.5000,
            "roundedSum": 0,
            "vatTotalRoundedSum": 0,
            "currencyRate": 1,
            "typeCode": "DOCUMENT_SELL",
            "hash": "e0fe88c327cff754f8dbf66be3fda74",
            "projectId": 0,
            "code": "6",
            "transactionDate": "2020-07-10",
            "note": "",
            "printedInfo": "",
            "referringIdentifier": "",
            "actionId": 0,
            "partnerDocumentId": null,
            "activityId": 0,
            "documentStatusTypeCode": "STATUS_CONFIRMED",
            "vatTotalsByTaxRate": null,
            "discountSum": null,
            "rows": null,
            "payments": null,
            "customer": null
        }
    ],
    "totalCount": 1
}
