tests/fixtures/invoices-get-one.json

{
    "id": 1,
    "number": "#TT1100720",
    "customerId": 1,
    "customerName": "Test MTÜ",
    "date": "2020-07-10",
    "currencyCode": "CURRENCY_EUR",
    "discountPercent": 0.000000,
    "languageCode": "LANGUAGE_EN",
    "vatPercent": 0.0000,
    "referenceNumber": "",
    "deadlineDate": "2020-07-17",
    "creatorName": null,
    "modifierName": null,
    "sumNoVat": 3.670000,
    "taxSum": null,
    "sumWithVat": 4.400000,
    "sumPaid": 4.400000,
    "sumLeftToPay": null,
    "invoiceTextsInfoId": 272768,
    "penaltyPercent": 0.5000,
    "roundedSum": 0,
    "vatTotalRoundedSum": 0,
    "currencyRate": 1,
    "typeCode": "DOCUMENT_SELL",
    "hash": "e0fe88c327cff754f8dbf66be3fda74",
    "projectId": 0,
    "code": "6",
    "transactionDate": "2020-07-10",
    "note": "",
    "printedInfo": "",
    "referringIdentifier": "",
    "actionId": 0,
    "partnerDocumentId": null,
    "activityId": 0,
    "documentStatusTypeCode": "STATUS_CONFIRMED",
    "vatTotalsByTaxRate": null,
    "discountSum": null,
    "rows": [
        {
            "id": 124992081,
            "articleId": 813397,
            "articleName": "Miuuvi platvormil piletite ja lisateenuste müük",
            "unitCode": null,
            "code": "",
            "quantity": 1.000000,
            "price": 3.670000,
            "discount": 0.000000,
            "extraCharge": 0.000000,
            "vatPercent": 20.000000,
            "vatAccountId": 3286704,
            "expenseAccountId": 3286726,
            "revenueAccountId": 3286720,
            "debtAccountId": 3286685,
            "transactionEntryId": 180802586,
            "transactionDate": "2020-07-10",
            "invoiceId": 29798407,
            "customerId": 0,
            "customerName": null,
            "invoiceNumber": null,
            "registrationCode": null,
            "referringIdentifier": null,
            "typeCode": "ARTICLE_ROW_SELL",
            "projectId": 0,
            "taxRateId": 225388,
            "activityItemId": 0,
            "residualValue": 0.000000,
            "partnerTaxRateId": null,
            "partnerTaxRateName": null
        }
    ],
    "payments": null,
    "customer": null
}
